cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xT.svd
        <!-- REGISTER "ELVR" -->
        <register>
          <name>ELVR</name>
          <description> register ELVR </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB15" -->
            <field>
              <name>LB15</name>
              <description> bitfield LB15 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA15" -->
            <field>
              <name>LA15</name>
              <description> bitfield LA15 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB14" -->
            <field>
              <name>LB14</name>
              <description> bitfield LB14 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA14" -->
            <field>
              <name>LA14</name>
              <description> bitfield LA14 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB13" -->
            <field>
              <name>LB13</name>
              <description> bitfield LB13 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA13" -->
            <field>
              <name>LA13</name>
              <description> bitfield LA13 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB12" -->
            <field>
              <name>LB12</name>
              <description> bitfield LB12 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA12" -->
            <field>
              <name>LA12</name>
              <description> bitfield LA12 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB11" -->
            <field>
              <name>LB11</name>
              <description> bitfield LB11 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA11" -->
            <field>
              <name>LA11</name>
              <description> bitfield LA11 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB10" -->
            <field>
              <name>LB10</name>
              <description> bitfield LB10 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA10" -->
            <field>
              <name>LA10</name>
              <description> bitfield LA10 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB9" -->
            <field>
              <name>LB9</name>
              <description> bitfield LB9 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA9" -->
            <field>
              <name>LA9</name>
              <description> bitfield LA9 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB8" -->
            <field>
              <name>LB8</name>
              <description> bitfield LB8 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA8" -->
            <field>
              <name>LA8</name>
              <description> bitfield LA8 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB7" -->
            <field>
              <name>LB7</name>
              <description> bitfield LB7 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA7" -->
            <field>
              <name>LA7</name>
              <description> bitfield LA7 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB6" -->
            <field>
              <name>LB6</name>
              <description> bitfield LB6 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA6" -->
            <field>
              <name>LA6</name>
              <description> bitfield LA6 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB5" -->
            <field>
              <name>LB5</name>
              <description> bitfield LB5 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA5" -->
            <field>
              <name>LA5</name>
              <description> bitfield LA5 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB4" -->
            <field>
              <name>LB4</name>
              <description> bitfield LB4 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA4" -->
            <field>
              <name>LA4</name>
              <description> bitfield LA4 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB3" -->
            <field>
              <name>LB3</name>
              <description> bitfield LB3 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA3" -->
            <field>
              <name>LA3</name>
              <description> bitfield LA3 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB2" -->
            <field>
              <name>LB2</name>
              <description> bitfield LB2 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA2" -->
            <field>
              <name>LA2</name>
              <description> bitfield LA2 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB1" -->
            <field>
              <name>LB1</name>
              <description> bitfield LB1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA1" -->
            <field>
              <name>LA1</name>
              <description> bitfield LA1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB0" -->
            <field>
              <name>LB0</name>
              <description> bitfield LB0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA0" -->
            <field>
              <name>LA0</name>
              <description> bitfield LA0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
