cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xT.svd
        <!-- REGISTER "EP2C" -->
        <register>
          <name>EP2C</name>
          <description> register EP2C </description>
          <addressOffset>0x212C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6040</resetValue>
          <resetMask>0xFE7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description> bitfield EPEN </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description> bitfield TYPE </description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description> bitfield DIR </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description> bitfield DMAE </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description> bitfield NULE </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description> bitfield STAL </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS" -->
            <field>
              <name>PKS</name>
              <description> bitfield PKS </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP3C" -->
        <register derivedFrom="EP2C">
          <name>EP3C</name>
          <description> register EP3C </description>
          <addressOffset>0x2130</addressOffset>
        </register>
        <!-- REGISTER "EP4C" -->
        <register derivedFrom="EP2C">
          <name>EP4C</name>
          <description> register EP4C </description>
          <addressOffset>0x2134</addressOffset>
        </register>
        <!-- REGISTER "EP5C" -->
        <register derivedFrom="EP2C">
          <name>EP5C</name>
          <description> register EP5C </description>
          <addressOffset>0x2138</addressOffset>
        </register>
        <!-- REGISTER "TMSP" -->
        <register>
          <name>TMSP</name>
          <description> register TMSP </description>
          <addressOffset>0x213C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMSP" -->
            <field>
              <name>TMSP</name>
              <description> bitfield TMSP </description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCS" -->
        <register>
          <name>UDCS</name>
          <description> register UDCS </description>
          <addressOffset>0x2140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUSP" -->
            <field>
              <name>SUSP</name>
              <description> bitfield SUSP </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOF" -->
            <field>
              <name>SOF</name>
              <description> bitfield SOF </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRST" -->
            <field>
              <name>BRST</name>
              <description> bitfield BRST </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUP" -->
            <field>
              <name>WKUP</name>
              <description> bitfield WKUP </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SETP" -->
            <field>
              <name>SETP</name>
              <description> bitfield SETP </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONF" -->
            <field>
              <name>CONF</name>
              <description> bitfield CONF </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCIE" -->
        <register>
          <name>UDCIE</name>
          <description> register UDCIE </description>
          <addressOffset>0x2141</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUSPIE" -->
            <field>
              <name>SUSPIE</name>
              <description> bitfield SUSPIE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIE" -->
            <field>
              <name>SOFIE</name>
              <description> bitfield SOFIE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRSTIE" -->
            <field>
              <name>BRSTIE</name>
              <description> bitfield BRSTIE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUPIE" -->
            <field>
              <name>WKUPIE</name>
              <description> bitfield WKUPIE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONFN" -->
            <field>
              <name>CONFN</name>
              <description> bitfield CONFN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CONFIE" -->
            <field>
              <name>CONFIE</name>
              <description> bitfield CONFIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
