cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xT.svd
        <!-- REGISTER "EP0DT" -->
        <register>
          <name>EP0DT</name>
          <description> register EP0DT </description>
          <addressOffset>0x2160</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFDT" -->
            <field>
              <name>BFDT</name>
              <description> bitfield BFDT </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1DT" -->
        <register derivedFrom="EP0DT">
          <name>EP1DT</name>
          <description> register EP1DT </description>
          <addressOffset>0x2164</addressOffset>
        </register>
        <!-- REGISTER "EP2DT" -->
        <register derivedFrom="EP0DT">
          <name>EP2DT</name>
          <description> register EP2DT </description>
          <addressOffset>0x2168</addressOffset>
        </register>
        <!-- REGISTER "EP3DT" -->
        <register derivedFrom="EP0DT">
          <name>EP3DT</name>
          <description> register EP3DT </description>
          <addressOffset>0x216C</addressOffset>
        </register>
        <!-- REGISTER "EP4DT" -->
        <register derivedFrom="EP0DT">
          <name>EP4DT</name>
          <description> register EP4DT </description>
          <addressOffset>0x2170</addressOffset>
        </register>
        <!-- REGISTER "EP5DT" -->
        <register derivedFrom="EP0DT">
          <name>EP5DT</name>
          <description> register EP5DT </description>
          <addressOffset>0x2174</addressOffset>
        </register>
        <!-- REGISTER "HCNT" -->
        <register>
          <name>HCNT</name>
          <description> register HCNT </description>
          <addressOffset>0x2100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0100</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOFSTEP" -->
            <field>
              <name>SOFSTEP</name>
              <description> bitfield SOFSTEP </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANCEL" -->
            <field>
              <name>CANCEL</name>
              <description> bitfield CANCEL </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RETRY" -->
            <field>
              <name>RETRY</name>
              <description> bitfield RETRY </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWKIRE" -->
            <field>
              <name>RWKIRE</name>
              <description> bitfield RWKIRE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URIRE" -->
            <field>
              <name>URIRE</name>
              <description> bitfield URIRE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIRE" -->
            <field>
              <name>CMPIRE</name>
              <description> bitfield CMPIRE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNNIRE" -->
            <field>
              <name>CNNIRE</name>
              <description> bitfield CNNIRE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIRE" -->
            <field>
              <name>DIRE</name>
              <description> bitfield DIRE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIRE" -->
            <field>
              <name>SOFIRE</name>
              <description> bitfield SOFIRE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URST" -->
            <field>
              <name>URST</name>
              <description> bitfield URST </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HOST" -->
            <field>
              <name>HOST</name>
              <description> bitfield HOST </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HIRQ" -->
        <register>
          <name>HIRQ</name>
          <description> register HIRQ </description>
          <addressOffset>0x2104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xBF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCAN" -->
            <field>
              <name>TCAN</name>
              <description> bitfield TCAN </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWKIRQ" -->
            <field>
              <name>RWKIRQ</name>
              <description> bitfield RWKIRQ </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URIRQ" -->
            <field>
              <name>URIRQ</name>
              <description> bitfield URIRQ </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIRQ" -->
            <field>
              <name>CMPIRQ</name>
              <description> bitfield CMPIRQ </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNNIRQ" -->
            <field>
              <name>CNNIRQ</name>
              <description> bitfield CNNIRQ </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIRQ" -->
            <field>
              <name>DIRQ</name>
              <description> bitfield DIRQ </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIRQ" -->
            <field>
              <name>SOFIRQ</name>
              <description> bitfield SOFIRQ </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HERR" -->
        <register>
          <name>HERR</name>
          <description> register HERR </description>
          <addressOffset>0x2105</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSTSOF" -->
            <field>
              <name>LSTSOF</name>
              <description> bitfield LSTSOF </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RERR" -->
            <field>
              <name>RERR</name>
              <description> bitfield RERR </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOUT" -->
            <field>
              <name>TOUT</name>
              <description> bitfield TOUT </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRC" -->
            <field>
              <name>CRC</name>
              <description> bitfield CRC </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGERR" -->
            <field>
              <name>TGERR</name>
              <description> bitfield TGERR </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STUFF" -->
            <field>
              <name>STUFF</name>
              <description> bitfield STUFF </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HS" -->
            <field>
              <name>HS</name>
              <description> bitfield HS </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSTATE" -->
        <register>
          <name>HSTATE</name>
          <description> register HSTATE </description>
          <addressOffset>0x2108</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ALIVE" -->
            <field>
              <name>ALIVE</name>
              <description> bitfield ALIVE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKSEL" -->
            <field>
              <name>CLKSEL</name>
              <description> bitfield CLKSEL </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFBUSY" -->
            <field>
              <name>SOFBUSY</name>
              <description> bitfield SOFBUSY </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUSP" -->
            <field>
              <name>SUSP</name>
              <description> bitfield SUSP </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMODE" -->
            <field>
              <name>TMODE</name>
              <description> bitfield TMODE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSTAT" -->
            <field>
              <name>CSTAT</name>
              <description> bitfield CSTAT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HFCOMP" -->
        <register>
          <name>HFCOMP</name>
          <description> register HFCOMP </description>
          <addressOffset>0x2109</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRAMECOMP" -->
            <field>
              <name>FRAMECOMP</name>
              <description> bitfield FRAMECOMP </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HRTIMER" -->
        <register>
          <name>HRTIMER</name>
          <description> register HRTIMER </description>
          <addressOffset>0x210C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTIMER1" -->
            <field>
              <name>RTIMER1</name>
              <description> bitfield RTIMER1 </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTIMER0" -->
            <field>
              <name>RTIMER0</name>
              <description> bitfield RTIMER0 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HRTIMER2" -->
        <register>
          <name>HRTIMER2</name>
          <description> register HRTIMER2 </description>
          <addressOffset>0x2110</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTIMER2" -->
            <field>
              <name>RTIMER2</name>
              <description> bitfield RTIMER2 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HADR" -->
        <register>
          <name>HADR</name>
          <description> register HADR </description>
          <addressOffset>0x2111</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDRESS" -->
            <field>
              <name>ADDRESS</name>
              <description> bitfield ADDRESS </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
